1) Що  таке  Реакт
2) Що таке  компоненти  в  реакті
3) Концепція  virtual  dom
4) Різниця  між  State Props стейтом  та пропсами
5) Що таке  хуки 
  useState useEffect
6) Чи  можна  використовувти  реакт хуки  у  вкладених  функціях 
7) useMemo useCallback  hook . Навіщо вони і яка  різниця  між ними
8) Для  чого  використовуєтсья  useRef хука
9) useEffect навіщо  масив  в  другому  аргументі
10) Що таке  React.Fragment і яка різниця між  <></>
11) Що таке  key , для  чого  він  та  яким  він  повинен  бути
12) Що таке  React  portals
13) Що таке  Реакт  Контекст
14) Чим  відрізняється  реакт  від  ангуляра  



